# Pandas

In [6]:
import pandas as pd
import numpy as np

## Creating Pandas Series

In [7]:
# Pandas is capturing the indexes internally
# However, numpy is capturing the data as array

# We can think the series as vector !!!!
serie = pd.Series([10,43,53,11,2,34])

In [8]:
type(serie)

pandas.core.series.Series

In [9]:
serie.axes

[RangeIndex(start=0, stop=6, step=1)]

In [10]:
serie.dtype

dtype('int64')

In [11]:
serie.ndim

1

In [12]:
# Accessing the data as an numpy array
serie.values

array([10, 43, 53, 11,  2, 34])

In [13]:
serie.head()

0    10
1    43
2    53
3    11
4     2
dtype: int64

In [14]:
serie.tail()

1    43
2    53
3    11
4     2
5    34
dtype: int64

In [15]:
# Also, we can assign the index values as we desire
pd.Series([4,6,4,6,9,64,444,754], index=[1,3,5,4,2,'a','x', 'e'])

1      4
3      6
5      4
4      6
2      9
a     64
x    444
e    754
dtype: int64

In [16]:
dic = pd.Series({'reg':10, 'log':11, 'cart':12})
dic

reg     10
log     11
cart    12
dtype: int64

In [17]:
# Concat
pd.concat([dic, serie])

reg     10
log     11
cart    12
0       10
1       43
2       53
3       11
4        2
5       34
dtype: int64

## Element Processing

In [18]:
a = np.array([12,3,4133,552,331])
serie = pd.Series(a)
serie

0      12
1       3
2    4133
3     552
4     331
dtype: int64

In [19]:
serie.index

RangeIndex(start=0, stop=5, step=1)

In [20]:
serie.keys

<bound method Series.keys of 0      12
1       3
2    4133
3     552
4     331
dtype: int64>

In [21]:
# listing key and value 
list(serie.items())

[(0, 12), (1, 3), (2, 4133), (3, 552), (4, 331)]

In [22]:
#numpy array
serie.values

array([  12,    3, 4133,  552,  331])

In [23]:
"reg" in serie

False

In [24]:
"1" in serie

False

In [25]:
1 in serie

True

In [26]:
# fancy index usage
serie[[1,2]]

1       3
2    4133
dtype: int64

## Creating Pandas DataFrame

In [27]:
df= [4,5,32,55,333,63]
pd.DataFrame(df, columns = ["Random Numbers"])

   Random Numbers
0               4
1               5
2              32
3              55
4             333
5              63

In [28]:
m = np.arange(1,10).reshape(3,3)
df = pd.DataFrame(m, columns =["rnn", "rnn1", "rnn2"])

In [29]:
df.head()

   rnn  rnn1  rnn2
0    1     2     3
1    4     5     6
2    7     8     9

In [30]:
type(df)

pandas.core.frame.DataFrame

In [31]:
df.shape

(3, 3)

In [32]:
df.ndim

2

In [33]:
df.size

9

In [34]:
# Switch to Numpy Array
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

## Pandas Element Manipulations

In [35]:
s1 = np.random.randint(10,size=5)
s2 = np.random.randint(10,size=5)
s3 = np.random.randint(10,size=5)

In [36]:
dic = {"var1": s1, "var2": s2, "var3": s3}
dic

{'var1': array([0, 9, 7, 0, 6]),
 'var2': array([0, 9, 6, 2, 7]),
 'var3': array([0, 1, 2, 9, 3])}

In [37]:
df =pd.DataFrame(dic)
df.head()

   var1  var2  var3
0     0     0     0
1     9     9     1
2     7     6     2
3     0     2     9
4     6     7     3

In [38]:
df.index = ["a","b","c","d","e"]

In [39]:
df.head()

   var1  var2  var3
a     0     0     0
b     9     9     1
c     7     6     2
d     0     2     9
e     6     7     3

In [40]:
# Dropping the values
df.drop("a", axis =0)

   var1  var2  var3
b     9     9     1
c     7     6     2
d     0     2     9
e     6     7     3

In [41]:
# However the raw data didn't change
df

   var1  var2  var3
a     0     0     0
b     9     9     1
c     7     6     2
d     0     2     9
e     6     7     3

In [42]:
# Dropping the values
# Inplace = true means that it will change the raw data
df.drop("a", axis =0, inplace=True)
df

   var1  var2  var3
b     9     9     1
c     7     6     2
d     0     2     9
e     6     7     3

In [43]:
#fancy index usage for dropping multiple data
l = ["c","e"]
df.drop(l, axis =0, inplace=True)

In [44]:
df

   var1  var2  var3
b     9     9     1
d     0     2     9

In [45]:
# Let's check the variables
l = ["var1", "var3", "var4"]

for i in l:
    print(i in df)

True
True
False

In [46]:
# Creating column using another column in df
df["var4"] = df["var1"] *5

In [47]:
df

   var1  var2  var3  var4
b     9     9     1    45
d     0     2     9     0

In [48]:
# Droping the columns
df.drop(["var4"], axis = 1, inplace=True)

In [49]:
df

   var1  var2  var3
b     9     9     1
d     0     2     9

## Selecting the variables and observations

- loc and iloc

In [50]:
mat = np.random.randint(1,30, size =(10,3))
df =pd.DataFrame(mat, columns =["var1", "var2", "var3"])

In [51]:
df

   var1  var2  var3
0    22     3    27
1    28     7     3
2    17     6    12
3    29    20    24
4     3    14     3
5     2     8     5
6    16    22    20
7    25    25    23
8     5     9    20
9     7     1    11

In [52]:
# loc tanimlandigi sekli ile secim yapar
# 3.indeksi aliyor
df.loc[0:3]

   var1  var2  var3
0    22     3    27
1    28     7     3
2    17     6    12
3    29    20    24

In [53]:
# iloc: alisik oldugumuz indeksleme mantigi ile secim yapar
# 3.indeksi almiyor
df.iloc[0:3]

   var1  var2  var3
0    22     3    27
1    28     7     3
2    17     6    12

In [54]:
df.iloc[:3,:2]

   var1  var2
0    22     3
1    28     7
2    17     6

In [55]:
df.loc[0:3, "var3"]

0    27
1     3
2    12
3    24
Name: var3, dtype: int64

In [56]:
df[0:2]["var1"]

0    22
1    28
Name: var1, dtype: int64

## Conditional Element Manipulations

In [57]:
df[df.var1 > 15]

   var1  var2  var3
0    22     3    27
1    28     7     3
2    17     6    12
3    29    20    24
6    16    22    20
7    25    25    23

In [58]:
df[df.var1 > 15]["var1"]

0    22
1    28
2    17
3    29
6    16
7    25
Name: var1, dtype: int64

In [59]:
df[(df.var1 > 15) & (df.var3 < 5) ]

   var1  var2  var3
1    28     7     3

In [60]:
df.loc[(df.var1 > 15), ["var1", "var2"]]

   var1  var2
0    22     3
1    28     7
2    17     6
3    29    20
6    16    22
7    25    25

## Concat, Join, Merge

In [61]:
df2 = df + 199
df2

   var1  var2  var3
0   221   202   226
1   227   206   202
2   216   205   211
3   228   219   223
4   202   213   202
5   201   207   204
6   215   221   219
7   224   224   222
8   204   208   219
9   206   200   210

In [63]:
# Check the index values, there are some problems
pd.concat([df,df2])

   var1  var2  var3
0    22     3    27
1    28     7     3
2    17     6    12
3    29    20    24
4     3    14     3
5     2     8     5
6    16    22    20
7    25    25    23
8     5     9    20
9     7     1    11
0   221   202   226
1   227   206   202
2   216   205   211
3   228   219   223
4   202   213   202
5   201   207   204
6   215   221   219
7   224   224   222
8   204   208   219
9   206   200   210

In [64]:
?pd.concat

Signature:
pd.concat(
    objs: Union[Iterable[~FrameOrSeries], Mapping[Union[Hashable, NoneType], ~FrameOrSeries]],
    axis=0,
    join='outer',
    ignore_index: bool = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: bool = False,
    sort: bool = False,
    copy: bool = True,
) -> Union[ForwardRef('DataFrame'), ForwardRef('Series')]
Docstring:
Concatenate pandas objects along a particular axis with optional set logic
along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned when `join`
    is 'outer'.
    This has no effect when ``join='inner'``, which already preserves
    the order of the non-concatenation axis.

    .. versionadded:: 0.23.0
    .. versionchanged:: 1.0.0

       Changed to not sort by default.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
Series.append : Concatenate Series.
DataFrame.append : Concatenate DataFrames.
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']
File:      ~/opt/anaconda3/lib/python3.8/site-packages/pandas/core/reshape/concat.py
Type:      function

In [65]:
# Now the problem is gone :) #
pd.concat([df,df2],ignore_index = True)

    var1  var2  var3
0     22     3    27
1     28     7     3
2     17     6    12
3     29    20    24
4      3    14     3
5      2     8     5
6     16    22    20
7     25    25    23
8      5     9    20
9      7     1    11
10   221   202   226
11   227   206   202
12   216   205   211
13   228   219   223
14   202   213   202
15   201   207   204
16   215   221   219
17   224   224   222
18   204   208   219
19   206   200   210

In [67]:
pd.concat([df,df2], ignore_index = True, join = "inner")

    var1  var2  var3
0     22     3    27
1     28     7     3
2     17     6    12
3     29    20    24
4      3    14     3
5      2     8     5
6     16    22    20
7     25    25    23
8      5     9    20
9      7     1    11
10   221   202   226
11   227   206   202
12   216   205   211
13   228   219   223
14   202   213   202
15   201   207   204
16   215   221   219
17   224   224   222
18   204   208   219
19   206   200   210

In [69]:
pd.concat([df,df2], ignore_index= True, sort =True)

    var1  var2  var3
0     22     3    27
1     28     7     3
2     17     6    12
3     29    20    24
4      3    14     3
5      2     8     5
6     16    22    20
7     25    25    23
8      5     9    20
9      7     1    11
10   221   202   226
11   227   206   202
12   216   205   211
13   228   219   223
14   202   213   202
15   201   207   204
16   215   221   219
17   224   224   222
18   204   208   219
19   206   200   210

In [78]:
df1 = pd.DataFrame({'employee': ['Adam', 'John', 'Max', 'Eve'],
                    'group': ['Finance', 'Engineering', 'Engineering', 'HR']})

df1

  employee        group
0     Adam      Finance
1     John  Engineering
2      Max  Engineering
3      Eve           HR

In [79]:
df2 = pd.DataFrame({'employee': ['Eve', 'Adam', 'John', 'Max'],
                    'year_of_recruiment': [2010, 2009, 2014, 2019]})

df2

  employee  year_of_recruiment
0      Eve                2010
1     Adam                2009
2     John                2014
3      Max                2019

In [86]:
# on is referring the which columns will be reference
df3 =pd.merge(df1, df2, on="employee")
df3

  employee        group  year_of_recruiment
0     Adam      Finance                2009
1     John  Engineering                2014
2      Max  Engineering                2019
3      Eve           HR                2010

In [87]:
# Many to One Merge

df4 = pd.DataFrame({'group': ['Finance', 'Engineering', 'HR'],
                    'manager': ['John', 'Maxwin', 'Samuel']})

In [88]:
pd.merge(df3,df4)

  employee        group  year_of_recruiment manager
0     Adam      Finance                2009    John
1     John  Engineering                2014  Maxwin
2      Max  Engineering                2019  Maxwin
3      Eve           HR                2010  Samuel

In [89]:
# Many to Many Merge

In [91]:
df5 = pd.DataFrame({'group': ['Finance', 'Finance',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['Math', 'Excel', 'Coding', 'Linux',
                               'Excel', 'Leardership']})

df5

         group       skills
0      Finance         Math
1      Finance        Excel
2  Engineering       Coding
3  Engineering        Linux
4           HR        Excel
5           HR  Leardership

In [92]:
df1

  employee        group
0     Adam      Finance
1     John  Engineering
2      Max  Engineering
3      Eve           HR

In [94]:
pd.merge(df1,df5)

  employee        group       skills
0     Adam      Finance         Math
1     Adam      Finance        Excel
2     John  Engineering       Coding
3     John  Engineering        Linux
4      Max  Engineering       Coding
5      Max  Engineering        Linux
6      Eve           HR        Excel
7      Eve           HR  Leardership

## Aggregations and Grouping

Basic Aggregation Functions;

* count()
* first()
* last()
* mean()
* median()
* min()
* max()
* std()
* var()
* sum()

In [95]:
import seaborn as sns

In [97]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [98]:
df.shape

(1035, 6)

In [100]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [101]:
df['mass'].count()

513

In [102]:
df['mass'].min()

0.0036

In [103]:
df['mass'].var()

14.58183312700122

In [109]:
# Basic statistical description of the dataset
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [110]:
# Dropping missing values with dropna method
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [113]:
# Grouping
df = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': [10,11,52,23,43,55]}, columns=['groups', 'data'])
df

  groups  data
0      A    10
1      B    11
2      C    52
3      A    23
4      B    43
5      C    55

In [114]:
df.groupby("groups")

In [116]:
# Most of the time Aggregation functions and groupping use together
df.groupby("groups").mean()

        data
groups
A       16.5
B       27.0
C       53.5

In [118]:
df = sns.load_dataset("planets")
df.head(10)

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009
5  Radial Velocity       1         185.840   4.80     76.39  2008
6  Radial Velocity       1        1773.400   4.64     18.15  2002
7  Radial Velocity       1         798.500    NaN     21.41  1996
8  Radial Velocity       1         993.300  10.30     73.10  2008
9  Radial Velocity       2         452.800   1.99     74.79  2010

In [119]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [121]:
df.dropna().groupby("method")["mass"].mean()

method
Radial Velocity    2.511411
Transit            1.470000
Name: mass, dtype: float64

In [122]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

## Aggregate, Filter, Transform and Apply

In [128]:
df = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]},
                   columns = ['groups', 'var1', 'var2'])
df

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

### Aggregate

In [129]:
df.groupby("groups").mean()

        var1  var2
groups
A         16   181
B         17   182
C         66   651

In [139]:
import numpy as np
df.groupby("groups").aggregate(["min", np.median, 'max'])

       var1            var2
        min median max  min median  max
groups
A        10     16  22  100    181  262
B        11     17  23  111    182  253
C        33     66  99  333    651  969

In [140]:
df.groupby("groups").aggregate({"var1": np.median, "var2": "max"})

        var1  var2
groups
A         16   262
B         17   253
C         66   969

### Filter

In [145]:
df = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]},
                   columns = ['groups', 'var1', 'var2'])
df

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [146]:
def filter_func(x):
    return x["var1"].std() > 9

In [148]:
df.groupby("groups").filter(filter_func)

  groups  var1  var2
2      C    33   333
5      C    99   969

### Transform

In [149]:
df = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]},
                   columns = ['groups', 'var1', 'var2'])
df

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [154]:
df_a = df.iloc[:, 1:3]
df_a

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969

In [155]:
df_a.transform(lambda x: (x-x.mean()) / x.std())

       var1      var2
0 -0.687871 -0.738461
1 -0.299074 -0.263736
2  0.000000 -0.015514
3 -0.328982 -0.235811
4 -0.657963 -0.704331
5  1.973890  1.957853

### Apply

In [156]:
df = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]},
                   columns = ['groups', 'var1', 'var2'])
df

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [157]:
df_b = df.iloc[:, 1:3]
df_b

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969

In [158]:
df_b.apply(np.sum)

var1     198
var2    2028
dtype: int64

In [159]:
df_c = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]},
                   columns = ['groups', 'var1', 'var2'])
df_c

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [161]:
df_c.groupby("groups").apply(np.sum)

       groups  var1  var2
groups
A          AA    32   362
B          BB    34   364
C          CC   132  1302

## Pivot Tables

In [164]:
import seaborn as sns
import pandas as pd
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [165]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [169]:
titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [170]:
titanic.pivot_table("survived", index = "sex", columns = "class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [171]:
titanic.age.head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [174]:
# Grouping the age column
age = pd.cut(titanic["age"], [0,18,90])
age.head()

0    (18, 90]
1    (18, 90]
2    (18, 90]
3    (18, 90]
4    (18, 90]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [175]:
titanic.pivot_table("survived", ["sex", age], "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663